In [13]:
# import packages commonly
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from pandas import DataFrame,Series

obj = Series([4, 7, -5, 3])

In [14]:
obj.values

array([ 4,  7, -5,  3])

In [15]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
obj2 = Series([ 4,  7, -5,  3], index=['d', 'b', 'a', 'c'])

In [17]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [19]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [20]:
obj2['a']

-5

In [21]:
obj2['d'] = 6

In [22]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [23]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [24]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [25]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [26]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [27]:
'b' in obj2

True

In [28]:
'e' in obj2

False

In [29]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [32]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [33]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [34]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [36]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [37]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [38]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [39]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [40]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [41]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [43]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [46]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'dept'], index=['one', 'two', 'three', 'four', 'five'])

In [47]:
frame2

       year   state  pop dept
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [45]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [48]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [49]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
dept      NaN
Name: three, dtype: object

In [50]:
frame2['dept'] = 16.5

In [51]:
frame2

       year   state  pop  dept
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [52]:
frame2.dept = np.arange(5.)

In [53]:
frame2

       year   state  pop  dept
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [54]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [55]:
frame2['dept'] = val

In [56]:
frame2

       year   state  pop  dept
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [66]:
frame2['eastern'] = frame2.state == 'Ohio'

In [67]:
frame2

       year state  pop  dept eastern
one    2000  Ohio  1.5   NaN    True
two    2001  Ohio  1.7  -1.2    True
three  2002  Ohio  3.6   NaN    True
four   2001  Ohio  2.4  -1.5    True
five   2002  Ohio  2.9  -1.7    True

In [69]:
del frame2['eastern']

In [70]:
frame2

       year state  pop  dept
one    2000  Ohio  1.5   NaN
two    2001  Ohio  1.7  -1.2
three  2002  Ohio  3.6   NaN
four   2001  Ohio  2.4  -1.5
five   2002  Ohio  2.9  -1.7

In [71]:
frame2.columns

Index([u'year', u'state', u'pop', u'dept'], dtype='object')

In [72]:
pop = {'wujunwei':{2016:16000,2017:32000}, 'wujunchao':{2000:1000, 2016:3000, 2017:8000}}

In [73]:
frame3 = DataFrame(pop)

In [74]:
frame3

      wujunchao  wujunwei
2000       1000       NaN
2016       3000   16000.0
2017       8000   32000.0

In [75]:
frame3.T

             2000     2016     2017
wujunchao  1000.0   3000.0   8000.0
wujunwei      NaN  16000.0  32000.0

In [77]:
DataFrame(pop, index=[2016,2017,2018])

      wujunchao  wujunwei
2016     3000.0   16000.0
2017     8000.0   32000.0
2018        NaN       NaN

In [78]:
frame3

      wujunchao  wujunwei
2000       1000       NaN
2016       3000   16000.0
2017       8000   32000.0

In [80]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [81]:
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [84]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [86]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [87]:
obj3.reindex(range(6), method='backfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [88]:
obj3.drop(4)

0      blue
2    purple
dtype: object

In [93]:
%quickref

In [94]:
ls_res = !ls
ls_res

['test.py', 'Untitled.ipynb']

In [96]:
ls

test.py  Untitled.ipynb

In [97]:
%bookmark -l

Current bookmarks: